natConvCylinder/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale       1.0;

R           0.0781;
k           0.5;
H           #eval{$k * $R};
h           #eval{0.05 * $H}; // size of cell
N 100;


vertices
(
    (0 0 0) // 0
    (#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{$h/2} 0) // 1
    (#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{($R / $R) * $h/2} $H) // 2
    (0 0 $H) // 3
    (#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{-$h/2} 0) // 4
    (#eval{sqrt($R * $R - ($h/2) * ($h/2))} #eval{-(($R / $R) * $h/2)} $H) // 5
);


blocks
(
    hex (0 4 1 0 3 5 2 3) ($N  1 #eval{ceil($k * $N)}) simpleGrading (1 1 1)
);

edges
(
arc 4 1 ($R 0 0)
arc 2 5 ($R 0 $H)
);

boundary
(
     front
     { 
           type wedge;
           faces  
           (
               (0 1 2 3)
           );
      }
     back
     { 
           type wedge;
           faces  
           (
               (0 3 5 4)
           );
      }
     tankWall
     { 
           type wall;
           faces  
           (
               (1 4 5 2)
           );
      }
     bottom
     { 
           type wall;
           faces  
           (
               (0 4 1 0)
           );
      }
     top
     { 
           type wall;
           faces  
           (
               (3 5 2 3)
           );
      }
     axis
     { 
           type empty;
           faces  
           (
               (0 3 3 0)
           );
      }
);

mergePatchPairs
(
);
