natConvCylinder/case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver  GAMG;
        smoother        GaussSeidel;
        relTol  1.0E-6;
        cacheAgglomeration      true;
        nFinestSweeps   2;
        nPreSweeps      1;
        maxIter 1000;
        nPostSweeps     2;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel   10;
        tolerance       1.0E-7;
        mergeLevels     1;
    }

    "(U|T)"
    {
        solver          PBiCGStab;
        smoother        GaussSeidel;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          1e-5;
    }
}

SIMPLE
{

    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-2;
        U               1e-3;
        T               1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.5;
    }
    equations
    {
        U               0.8;
        T               0.9;
    }
}


// ************************************************************************* //
